{
    "dev": [
        "Levels of knowing data structures:\n0 (ignorance): \"what’s a data structure?\"\n1 (interview knowledge): cocktail party level literacy\n2 (knowledge): \"this problem calls out for a heap\"\n3 (God mode): \"I only use data structures that I wrote myself\"",
        "Starting a basic website in 2014:\n1. Install Node\n2. Install Bower\n3. Pick CSS framework\n4. Pick responsive approach\n…\n47. Write some HTML",
        "- what's the name of your dog?\n- J.D.\n- what does J.D. stand for?\n- Just Dog.",
        "When your hammer is C++, everything begins to look like a thumb.",
        "A SQL query goes into a bar, walks up to two tables and asks, \"Can I join you?\"",
        "- Why do programmers always mix up Halloween and Christmas?\n- Because Oct 31 == Dec 25!",
        "- Knock, knock.\n- Who’s there?\nvery long pause…\n- Java.\n\n- Knock, knock.\n- Who’s there?\n- C++.\n\nKnock, knock.\n- Assembler.",
        "- How many programmers does it take to change a light bulb?\n- None, that's a hardware problem",
        "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program.\nThe rest of them will write Perl programs.",
        "- Whats the object-oriented way to become wealthy?\n- Inheritance",
        "[\"hip\",\"hip\"]\n(hip hip array!)",
        "Programming is like sex: one mistake and you have to support it for the rest of your life.",
        "- How many prolog programmers does it take to change a lightbulb?\n- Yes.",
        "To understand what recursion is, you must first understand recursion.",
        "The fantastic element that explains the appeal of games to many developers is neither the fire-breathing monsters nor the milky-skinned, semi-clad sirens; it is the experience of carrying out a task from start to finish without any change in the user requirements.",
        "There are 10 types of people in the world. Those who understand binary and those who have regular sex.",
        "Why programmers like UNIX: unzip, strip, touch, finger, grep, mount, fsck, more, yes, fsck, fsck, fsck, umount, sleep",
        "These two strings walk into a bar and sit down. The bartender says, \"So what'll it be?\"\nThe first string says, \"I think I'll have a beer quag fulk boorg jdk^CjfdLk jk3s d#f67howe%^U r89nvy owmc63^Dz x.xvcu\"\n\"Please excuse my friend,\" the second string says, \"He isn't null-terminated.\"",
        "Command line Russian roulette\n`[ $[ $RANDOM % 6 ] == 0 ] && rm -rf / || echo *Click*`",
        "Unix is user friendly. It's just very particular about who its friends are.",
        "Richard Stallman, Linus Torvalds, and Donald Knuth engage in a discussion on whose impact on computer science was the greatest.\nStallman: \"God told me I have programmed the best editor in the world!\"\nTorvalds: \"Well, God told me that I have programmed the best operating system in the world!\"\nKnuth: \"Wait, wait, I never said that.\"",
        "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn't.",
        "A foo walks into a bar, takes a look around and says \"Hello World!\" and meet up his friend Baz",
        "If this girl was a collection class, her insert method would be public.",
        "Keyboard not found… press F1 to continue",
        "Two bytes meet. The first byte asks, \"Are you ill?\"\nThe second byte replies, \"No, just feeling a bit off.\"",
        "If the box says, \"This software requires Windows XP or better,\" does that mean it'll run on linux?",
        "- What is the difference between a programmer and a non-programmer?\n- The non-programmer thinks a kilobyte is 1000 bytes while a programmer is convinced that a kilometer is 1024 meters",
        "Two threads walk into a bar. The barkeeper looks up and yells, \"hey, I want don't any conditions race like time last!\"",
        "Eight bytes walk into a bar. The bartender asks, \"Can I get you anything?\"\n\"Yeah,\" reply the bytes. \"Make us a double.\"",
        "If Java is the answer, it must have been a really verbose question.",
        "What do Computer Science students use for birth control?\nTheir personalities.",
        "Why doesn't C++ have a garbage collector?\nBecause there would be nothing left!",
        "Smith & Wesson - the original \"point and click\" interface.",
        "In theory, there ought to be no difference between theory and practice. In practice, there is.",
        "C++ - where your friends have access to your private members.",
        "A good programmer is someone who looks both ways before crossing a one-way street.",
        "The only \"intuitive\" user interface is the nipple. After that, it's all learned.",
        "- Why did the programmer quit his job?\n- Because he didn't get arrays.",
        "XML is like violence. If it doesn't solve your problem, you're not using enough of it.",
        "- Why do java programmers have to wear glasses?\n- Because they don't see sharp.",
        "I'd like to make the world a better place, but they won't give me the source code.",
        "There's no place like 127.0.0.1",
        "I don't see women as objects. I consider each to be in a class of her own.",
        ".NET is called .NET so that it wouldn't show up in a Unix directory listing.",
        "Hardware: The part of a computer that you can kick.",
        "It compiles! Let's ship it.",
        "In C we had to code our own bugs. In C++ we can inherit them.",
        "- How come there is not obfuscated Perl contest?\n- Because everyone would win.",
        "- I just saw a red-black squirrel!\n- Was it in a red-black tree?",
        "I have always wished for my computer to be as easy to use as my telephone; my wish has come true because I can no longer figure out how to use my telephone. (c) Stroustrup",
        "All arrays Chuck Norris declares are of infinite size, because Chuck Norris knows no bounds.",
        "Chuck Norris writes code that optimizes itself",
        "Chuck Norris can’t test for equality because he has no equal.",
        "Chuck Norris can write infinite recursion functions… and have them return.",
        "Chuck Norris can divide by zero.",
        "Chuck Norris can compile syntax errors.",
        "In Samsung Galaxy S4, the video will pause if you look away. In S5 a hand will come out and slap you if you look away while watching a video.",
        "Speed dating is useless.\n30s isn't long enough to explain the benefits of functional programming in Haskell.",
        "Sometimes I’m not sure if I’m looking at CoffeeScript or an unresolved  merge conflict in Git.",
        "Urban myth: the Ruby developer who managed to download all the Gems they needed within a 24-hour hackathon.",
        "Startups 101:\n1. Raise funding\n2. Start a podcast\n3. Stickers\n…\n43. More stickers\n…\n94. Oh shit, you forgot to build the product!",
        "86% of Java devs still get work due to startups putting Rails in their stack, which needs re-writing using something more grown up.",
        "When you send an AJAX call to a Java backend, you have to take a ticket and sit in the waiting room.",
        "Develop like there’s only one timezone,\nDesign like there’s only one screen size,\nDebug like there’s only one browser…",
        "One of our engineers just said he wants us to build a SOAP API next.\nUPDATE:  One of our former engineers.",
        "Just finished rewriting all my ember apps on backbone, and now I get to rewrite them all on angular. Feels good to make progress!",
        "PornHub's git repo is 752 GB.",
        "A user interface is like a joke. If you have to explain it, it's not that good.",
        "Irregular expressions.",
        "There is no framework so good that it will make a bad programmer develop a good app.",
        "For a movie role: people audition.\nFor a developer job: HOW DARE YOU MAKE ME LIVE CODE, I AM NOT A PERFORMING MONKEY.",
        "Waiter, there’s a bug in my code.",
        "Found a really cool way to stop others messing with my code:\n\n// Autogenerated, do not edit. All changes will be undone.",
        "No bugs were harmed during the creation of this software."
    ]
}